{
  "backend/main.mo": "Defines the main canister actor with access control, storage mixins, user approval, and extensive gym-management types for members, plans, payments, bookings, workouts, diets, and reports.",
  "backend/migration.mo": "Contains type definitions and structures used during migration tasks, supporting member profiles, credentials, communication logs, and various gym-related entities.",
  "feature_evidence.json": "Feature evidence report linking a specific authentication-related feature to affected frontend files, component versions, and test identifiers.",
  "frontend-file-summaries.txt": "Text file listing short descriptions for many frontend components, hooks, and pages involved in the gym management system.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, theme layers, and dark mode overrides.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx and mounting it to the root div.",
  "frontend/src/App.tsx": "Main React app component handling authentication for both admins and email/password members, initializing backend actors, and routing users to login or respective dashboards.",
  "frontend/src/components/admin/CommunicationDisclaimer.tsx": "Displays an alert explaining that communication logs are simulated and not actually delivered.",
  "frontend/src/components/admin/CommunicationSimulation.tsx": "Shows simulated communication logs and member credentials after manual member creation, with copy utilities.",
  "frontend/src/components/admin/FinancialManagement.tsx": "Financial dashboard for viewing payments and expenses and adding new payment or expense entries.",
  "frontend/src/components/admin/MemberManagement.tsx": "Admin interface for viewing, searching, creating, editing, and deleting members, managing membership plans, and handling profile picture uploads with pagination.",
  "frontend/src/components/admin/Reports.tsx": "Generates admin reports including revenue, expenses, membership stats, and sorted member status lists with charts and metrics.",
  "frontend/src/components/admin/StaffManagement.tsx": "Placeholder card indicating upcoming staff management features like trainer profiles and schedules.",
  "frontend/src/components/DashboardLayout.tsx": "Layout component handling header UI, theme switch, profile dropdowns, and logout logic for admin and member roles.",
  "frontend/src/components/member/AttendanceHistory.tsx": "Displays a member’s attendance records in a sortable table with check‑in and check‑out details.",
  "frontend/src/components/member/ClassBookings.tsx": "Allows members to book, view, and cancel class sessions, with dialogs for creating bookings and status badges.",
  "frontend/src/components/member/MemberOverview.tsx": "Shows member profile, membership status, days to expiry, and monthly attendance summary with profile picture support.",
  "frontend/src/components/member/MemberPortal.tsx": "Member dashboard combining profile info, attendance, bookings, payments, and notifications into a unified view.",
  "frontend/src/components/member/MyDiet.tsx": "Displays a member's diet plan with macros and meals, handling loading and missing-plan states.",
  "frontend/src/components/member/MyWorkouts.tsx": "Shows a member's workout plan, including duration and exercises, with loading and no-plan fallback.",
  "frontend/src/components/member/NotificationBanner.tsx": "Renders prioritized, dismissible notifications with styling, icons, and optional action buttons.",
  "frontend/src/components/member/PaymentWallet.tsx": "Fetches and displays payment totals and history with status badges and loading handling.",
  "frontend/src/components/ProfilePictureModal.tsx": "Modal for viewing a full-size profile picture with close controls.",
  "frontend/src/components/ProfileSettings.tsx": "Profile settings dialog allowing users to edit profile info, upload profile pictures, and manage roles if admin.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/QRCodeDialog.tsx": "Generates and displays a member QR code with options to copy data and close the dialog.",
  "frontend/src/components/trainer/AssignedMembers.tsx": "Empty file placeholder for trainer assigned-members component.",
  "frontend/src/components/trainer/DietBuilder.tsx": "Empty file placeholder for trainer diet-builder component.",
  "frontend/src/components/trainer/MemberDetailsDialog.tsx": "Empty file placeholder for trainer member-details dialog.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "Empty file placeholder for trainer workout-builder component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, roles, and authentication plus helpers for serializing member profiles and checking email/password members.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with tabbed sections for members, financials, staff, and reports.",
  "frontend/src/pages/LoginPage.tsx": "Implements member and Internet Identity login flows with form handling, error messaging, and navigation.",
  "frontend/src/pages/MemberDashboard.tsx": "Displays the member dashboard using DashboardLayout and MemberPortal.",
  "frontend/src/pages/TrainerDashboard.tsx": "Empty trainer dashboard file placeholder.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugin setup.",
  "project_state.json": "Describes the app’s current state, issues, and feature requests for a gym management system, including notification failures and missing real authentication for admin‑created members. Contains architectural notes, known issues, existing features, and new features to be implemented."
}