{
  "backend/main.mo": "Defines the main canister actor and initializes access control, user approval, and blob storage, along with many types for users, memberships, payments, classes, workouts, diet plans, and reports.",
  "feature_evidence.json": "Feature evidence report documenting admin UI enhancements for editing and deleting membership plans and referencing affected frontend files and components.",
  "frontend-file-summaries.txt": "Lists short summaries of key frontend components, hooks, and pages for both admin and member interfaces, including routing, dashboards, financials, workouts, diet, attendance, and plan management.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables, theme modes, and global styling rules for light and dark themes.",
  "frontend/index.html": "HTML entry point containing the root div and script loader for the React application.",
  "frontend/src/App.tsx": "Top-level app component handling admin and member authentication, backend actor initialization, and routing to dashboards or login.",
  "frontend/src/components/admin/CommunicationDisclaimer.tsx": "Static alert explaining that communication logs are simulated and not actually delivered.",
  "frontend/src/components/admin/CommunicationSimulation.tsx": "Displays simulated communication logs and member credentials after manual member creation, with clipboard copy utilities.",
  "frontend/src/components/admin/FinancialManagement.tsx": "Handles viewing and adding payments and expenses, calculating financial totals, and displaying them in tabbed tables.",
  "frontend/src/components/admin/MemberManagement.tsx": "Comprehensive member management UI supporting creation, editing, deletion, search, pagination, QR generation, and membership plan handling.",
  "frontend/src/components/admin/MembershipPlanManagement.tsx": "UI for viewing, editing, and deleting membership plans using dialogs and query hooks.",
  "frontend/src/components/admin/Reports.tsx": "Generates admin reports with revenue metrics, member stats, and charts using fetched report data.",
  "frontend/src/components/admin/StaffManagement.tsx": "Placeholder component displaying a coming‑soon message for staff management features.",
  "frontend/src/components/DashboardLayout.tsx": "Shared layout for admin and member dashboards with logout handling, profile display, theme toggling, and profile settings integration.",
  "frontend/src/components/member/AttendanceHistory.tsx": "Displays a member’s attendance records in a sortable table with check‑in and check‑out details.",
  "frontend/src/components/member/ClassBookings.tsx": "Allows members to book, view, and cancel class bookings with dialog forms and status badges.",
  "frontend/src/components/member/MemberOverview.tsx": "Shows a member’s profile, membership status, and attendance summary with profile picture support.",
  "frontend/src/components/member/MemberPortal.tsx": "Member dashboard aggregating profile, attendance, bookings, payments, and notifications into a unified view.",
  "frontend/src/components/member/MyDiet.tsx": "Fetches and displays a member’s diet plan with macros and meals, showing a loading spinner or empty state when needed.",
  "frontend/src/components/member/MyWorkouts.tsx": "Shows the member’s workout plan with duration and exercises, with loading and no-plan fallback states.",
  "frontend/src/components/member/NotificationBanner.tsx": "Displays dismissible, prioritized notifications with icons, colors, and optional action buttons.",
  "frontend/src/components/member/PaymentWallet.tsx": "Fetches and displays payment summaries and a sortable payment history table with status badges.",
  "frontend/src/components/ProfilePictureModal.tsx": "Dialog component that displays a full-size profile picture with close controls and transparent modal styling.",
  "frontend/src/components/ProfileSettings.tsx": "UI for viewing and updating a user's profile, profile picture, and roles, with admin-specific role assignment features.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file with no implemented content.",
  "frontend/src/components/QRCodeDialog.tsx": "Generates and displays a QR code for a member, with options to copy the underlying data and close the dialog.",
  "frontend/src/components/trainer/AssignedMembers.tsx": "Empty file placeholder for trainer assigned-members component.",
  "frontend/src/components/trainer/DietBuilder.tsx": "Empty file placeholder for diet plan builder component.",
  "frontend/src/components/trainer/MemberDetailsDialog.tsx": "Empty file placeholder for trainer member details dialog.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "Empty file placeholder for workout plan builder component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/clear functions, and persistent identity handling via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, roles, member auth, and various gym-related backend actions with serialization helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with tabbed sections for members, finances, staff, and reports.",
  "frontend/src/pages/LoginPage.tsx": "Implements member and Internet Identity login flows with UI, validation, and navigation.",
  "frontend/src/pages/MemberDashboard.tsx": "Wraps the member portal inside the member dashboard layout.",
  "frontend/src/pages/TrainerDashboard.tsx": "Empty trainer dashboard file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and session parameters for navigation state.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, plugins, and OKLCH variable mappings.",
  "project_state.json": "Tracks the app’s schema version, project state, existing features, known issues, and architectural notes for the Prime Fit Gym app. Highlights notification delivery issues and missing real auth account creation for admin-added members."
}