{
  "backend/main.mo": "Defines the main canister actor with authorization, blob storage, and user/member management types for profiles, memberships, payments, expenses, bookings, workouts, diet plans, and reporting.",
  "feature_evidence.json": "Feature evidence report placeholder containing an empty features array.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files, describing components, hooks, and functionality across the app.",
  "frontend/index.css": "Global Tailwind and OKLCH variable definitions for light and dark themes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication, identity loading, error states, and routing to admin or member dashboards.",
  "frontend/src/components/admin/CommunicationDisclaimer.tsx": "Static alert component explaining that communication logs are simulated and not actually sent.",
  "frontend/src/components/admin/CommunicationSimulation.tsx": "Displays simulated communication logs and member credentials after manual member creation, with copy-to-clipboard actions.",
  "frontend/src/components/admin/FinancialManagement.tsx": "Admin interface for viewing, adding, editing, and deleting payments and expenses, with dialogs and status management.",
  "frontend/src/components/admin/MemberManagement.tsx": "Full admin member management UI supporting creation, editing, deletion, search, pagination, QR code display, and membership plan handling.",
  "frontend/src/components/admin/MembershipPlanManagement.tsx": "Provides UI to view, edit, and delete membership plans using dialogs and table listings.",
  "frontend/src/components/admin/Reports.tsx": "Fetches and displays gym reports including revenue, expenses, membership stats, and charts.",
  "frontend/src/components/admin/StaffManagement.tsx": "Placeholder component indicating future staff and trainer management features.",
  "frontend/src/components/DashboardLayout.tsx": "Reusable layout for admin and member dashboards with theme toggle, profile menu, logout handling, and profile picture modal support.",
  "frontend/src/components/member/AttendanceHistory.tsx": "Displays a member’s attendance records sorted by date, with check-in/out times and durations.",
  "frontend/src/components/member/ClassBookings.tsx": "Allows members to book, view, and cancel class bookings with dialog forms and status badges.",
  "frontend/src/components/member/MemberOverview.tsx": "Shows member profile, membership status, profile picture, and monthly attendance summary.",
  "frontend/src/components/member/MemberPortal.tsx": "Aggregates member data into a dashboard showing profile, attendance, bookings, payments, and notifications.",
  "frontend/src/components/member/MyDiet.tsx": "Displays the member's diet plan with macros and meals, handling loading and missing-plan states.",
  "frontend/src/components/member/MyWorkouts.tsx": "Shows the member's workout plan with duration and exercises, with loaders and fallback when no plan exists.",
  "frontend/src/components/member/NotificationBanner.tsx": "Renders prioritized, dismissible notifications with icons, colors, and optional action buttons.",
  "frontend/src/components/member/PaymentWallet.tsx": "Fetches and displays payment history, totals, and status badges with error handling and retry support.",
  "frontend/src/components/ProfilePictureModal.tsx": "Dialog component for viewing enlarged profile pictures with close controls and click‑to‑dismiss behavior.",
  "frontend/src/components/ProfileSettings.tsx": "User profile settings UI that loads, edits, and saves profile data, including role management and profile picture updates.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/QRCodeDialog.tsx": "Generates and displays a QR code for a member, with options to copy the encoded data and close the dialog.",
  "frontend/src/components/trainer/AssignedMembers.tsx": "File is empty.",
  "frontend/src/components/trainer/DietBuilder.tsx": "File is empty.",
  "frontend/src/components/trainer/MemberDetailsDialog.tsx": "File is empty.",
  "frontend/src/components/trainer/WorkoutBuilder.tsx": "File is empty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, status tracking, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user roles, profiles, and authentication, with serialization helpers for member profiles.",
  "frontend/src/index.css": "Defines global Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard layout with tabs for members, financials, staff, and reports.",
  "frontend/src/pages/LoginPage.tsx": "Implements Internet Identity and email/password login UI with error handling and navigation.",
  "frontend/src/pages/MemberDashboard.tsx": "Wraps the member portal inside the member dashboard layout.",
  "frontend/src/pages/TrainerDashboard.tsx": "Empty placeholder for the trainer dashboard page.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and plugins.",
  "project_state.json": "Defines the current state of the Prime Fit Gym app, including project version, architectural notes, known issues, and a list of implemented feature entries. Used as a centralized reference for fixing notification delivery, member auth, and reporting problems."
}