{
  "kind": "build_request",
  "title": "Auto-generate member onboarding messages (email/SMS/WhatsApp) as in-app communication logs when admin creates a member",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for admin-created members to return a complete onboarding payload that includes the member profile, the admin-provided credentials, and generated communication log entries for Email, SMS, and WhatsApp containing the member’s login credentials plus membership plan and payment details.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-8"
        ],
        "quotes": [
          "build this",
          "When admin add members then his email id and password generated by admin send into email or mobile number and her membership plan and payment details send in message by mobile number sms and WhatsApp number"
        ]
      },
      "acceptanceCriteria": [
        "A backend method exists for the admin flow used by the frontend hook `useCreateMemberWithManualCredentials` that creates/persists the new `MemberProfile`, stores the credentials mapping, and returns `ManualCreateMemberResponse` (member + credentials + communicationLogs).",
        "`communicationLogs` contains exactly one entry per channel: `#email`, `#sms`, and `#whatsapp`.",
        "Each log entry content includes (in English) the member login email, the member login password (as entered by admin), membership plan name, plan duration, plan price, and membership start/end dates (or equivalent plan validity info already stored on the member).",
        "Because real delivery is not supported on this platform, each log entry status is NOT represented as actually delivered to a phone/email; set status to `#pending` (or `#failed` with an explicit reason in the content) consistently across channels.",
        "Only admins can invoke this member-creation operation; non-admin callers are rejected with an authorization error.",
        "If the requested email is not unique (already exists in credentials or member records), the call traps/returns an error and does not create partial state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the admin UI member-creation success experience to clearly present Email/SMS/WhatsApp outputs as simulated/not-delivered communication logs (not real notifications), while still allowing the admin to copy credentials and message content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "fix it",
          "build this"
        ]
      },
      "acceptanceCriteria": [
        "After successfully creating a member via the existing Add Member dialog in `frontend/src/components/admin/MemberManagement.tsx`, the success dialog renders the returned `communicationLogs` and clearly labels them as simulation/not delivered (English text).",
        "`frontend/src/components/admin/CommunicationSimulation.tsx` displays channel, timestamp, and message content as it does today, but the status label does not imply real delivery (e.g., it must not show “Sent” as a real-world outcome).",
        "The UI continues to provide copy-to-clipboard for the email and password and does not regress existing member creation functionality.",
        "Any user-facing explanatory text is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a consistent UI disclaimer anywhere the app shows Email/SMS/WhatsApp ‘notifications’ that these channels are simulated in-app logs and will not be delivered to a phone number within this platform build.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Email Notification , SMS Notification , WhatsApp Notification seen in backend but not send in phone number"
        ]
      },
      "acceptanceCriteria": [
        "At least one prominent disclaimer is shown in the admin communication log/simulation UI explaining that SMS/WhatsApp/Email delivery to real devices is not supported and what the admin should do instead (e.g., copy and share manually).",
        "The disclaimer is visible without needing to inspect console logs and is written in English.",
        "No immutable frontend paths are modified."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify any frontend files under `frontend/src/components/ui` or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not integrate third-party SMS, WhatsApp, or email delivery providers (e.g., Twilio, WhatsApp Business API, SendGrid, SMTP), as they are not supported on this platform."
  ],
  "nonGoals": [
    "Implementing real SMS delivery to phone numbers.",
    "Implementing real WhatsApp message delivery to phone numbers.",
    "Implementing real email delivery via external email providers.",
    "Adding new payment editing tools, membership editing tools, or removing expense tracking (these are mentioned in project state but not explicitly requested in the active scope beyond notifications/member onboarding)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}