{
  "kind": "build_request",
  "title": "Enable real member login for admin-created members (email/password)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Implement backend support for real email/password authentication for admin-created members so that a member added by an admin can successfully log in from the existing Member Login form.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "A backend method used by the frontend member login flow (currently `memberLogin(email, password)`) validates the provided email/password against stored member credentials and returns the logged-in member’s profile in the expected serialized format (matching the frontend’s `SerializeMemberProfile` -> `MemberProfile` deserialization).",
        "Invalid email or password results in a deterministic error message that includes the text \"Invalid credentials provided\" (to match the existing frontend error handling).",
        "Credentials are stored and checked in a way that does not rely on Internet Identity for members (email/password-only members can authenticate without II)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the backend admin member-creation pathway that accepts manual credentials (used by `addMemberWithManualCredentials`) to persist those credentials and associate them with the created member record so the member can later log in with the same email/password.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "When an admin creates a member with manual credentials, the backend persists the credentials so that a subsequent `memberLogin` with the same email/password succeeds.",
        "The backend enforces email uniqueness for member credentials at creation time (rejects duplicates with a clear error).",
        "Deleting a member also removes their stored credentials so the deleted member cannot log in anymore."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Make the member dashboard data-access flow work for email/password-authenticated members after login (i.e., member portal screens can load the logged-in member’s data without requiring the caller to be authenticated via Internet Identity).",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "After a successful member email/password login, the Member Dashboard renders and can load the logged-in member’s profile data from the backend (not only from sessionStorage fallback).",
        "Member-only backend operations used by the member portal work for email/password-authenticated members (either via a backend session mechanism or equivalent backend checks), without granting access to other members’ data.",
        "Admin authentication and admin-only permissions continue to require Internet Identity and are not weakened by the member email/password changes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (compose around them instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing real delivery of email/SMS/WhatsApp messages to external providers.",
    "Adding third-party authentication providers (only Internet Identity is supported for admin auth).",
    "Redesigning unrelated admin modules (finances, reports, staff) beyond what is required to enable member login."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}