{
  "kind": "build_request",
  "title": "Fix Reports > Member Financial Overview money due calculation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Fix the admin Reports data so that, in Reports > Member Financial Overview, the returned `ReportMember.moneyDue` value represents the correct outstanding balance for each member (not a value derived from an individual/personal payment record).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "In reports Member Financial Overview in money due shown by personal member payment"
        ]
      },
      "acceptanceCriteria": [
        "When an admin loads Reports, each row’s Money Due is computed as: member’s current membership plan price minus the sum of that member’s relevant payments (do not use a single payment record as the Money Due value).",
        "Money Due is never negative; if payments meet or exceed the plan price, Money Due is shown as 0.",
        "Payments considered for Money Due must match the member using the app’s current identifier approach (email/phone/principal as supported by the backend) so that payments recorded via email/phone are reflected in Reports.",
        "Reports continues to load successfully for an approved admin (no traps) and `ReportSummary.members[].moneyDue` is consistent with what the Reports UI displays."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional canisters/services.",
    "Do not edit files in frontend immutablePaths (per SYSTEM_CONTEXT).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new report sections or new fields to the Reports UI beyond fixing the Money Due calculation.",
    "Changing the visual design/layout of the Reports page beyond what is required to reflect the corrected Money Due values."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}