{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Member portal data access for email/password-authenticated members",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Enable member dashboard data loading and member-only operations for email/password-authenticated members after login (without requiring Internet Identity).",
      "acceptanceCriteria": [
        "After a successful member email/password login, the Member Dashboard renders and can load the logged-in member’s profile data from the backend (not only from sessionStorage fallback).",
        "Member-only backend operations used by the member portal work for email/password-authenticated members (either via a backend session mechanism or equivalent backend checks), without granting access to other members’ data.",
        "Admin authentication and admin-only permissions continue to require Internet Identity and are not weakened by the member email/password changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the generated backend type definitions to include any new backend capabilities introduced to support email/password member sessions (e.g., functions that accept a member session token for fetching the current member profile and member-portal data). Ensure types required by React Query hooks compile cleanly."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend the member-related React Query hooks to support an email/password member session mechanism (in addition to the existing Internet Identity caller-based flow). Read the member session material from sessionStorage (set during memberLogin) and use it when calling the corresponding backend capabilities so memberProfile, attendance, bookings, payments, and notifications can be fetched from the backend for email/password-authenticated members (not only from cached/sessionStorage fallback)."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Adjust member login handling to persist any backend-provided member session material needed for subsequent member-portal backend calls (beyond the existing memberAuth/profile cache), while keeping existing error handling that matches the backend error text \"Invalid credentials provided\". Keep all user-facing text in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the member-auth bootstrapping logic (sessionStorage memberAuth parsing + dashboard gating) so that after refresh the app can rehydrate the member session state needed for backend data fetches, and so the Member Dashboard render path waits for the backend-backed member profile fetch (not just the cached fallback) when an email/password session exists."
        },
        {
          "path": "frontend/src/components/DashboardLayout.tsx",
          "operation": "modify",
          "description": "Update logout behavior to correctly handle member email/password sessions: when role is 'member', clear member sessionStorage keys (e.g., memberAuth and memberProfileCache) and clear React Query cache, without changing or weakening the existing admin Internet Identity logout flow."
        }
      ]
    }
  ]
}